# Q1. Customer Placing the Largest Number of Orders

Table: Orders
```
+-----------------+----------+
| Column Name     | Type     |
+-----------------+----------+
| order_number    | int      |
| customer_number | int      |
+-----------------+----------+
```

```
order_number is the primary key (column with unique values) for this table.
This table contains information about the order ID and the customer ID.
```

Write a solution to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

The result format is in the following example.

Example 1:

Input:
Orders table:
```
+--------------+-----------------+
| order_number | customer_number |
+--------------+-----------------+
| 1            | 1               |
| 2            | 2               |
| 3            | 3               |
| 4            | 3               |
+--------------+-----------------+
```
Output:
```
+-----------------+
| customer_number |
+-----------------+
| 3               |
+-----------------+
```
Explanation:
The customer with number 3 has two orders, which is greater than either customer 1 or 2 because each of them only has one order.
So the result is customer_number 3.

In [ ]:
%%sql
Create table If Not Exists orders (order_number int, customer_number int);
Truncate table orders;
insert into orders (order_number, customer_number) values ('1', '1');
insert into orders (order_number, customer_number) values ('2', '2');
insert into orders (order_number, customer_number) values ('3', '3');
insert into orders (order_number, customer_number) values ('4', '3');

In [12]:
%%sql
select customer_number from orders
group by customer_number
order by count(customer_number) desc
limit 1

   customer_number
0                3

# Q2. Classes With at Least 5 Students

Table: Courses
```
+-------------+---------+
| Column Name | Type    |
+-------------+---------+
| student     | varchar |
| class       | varchar |
+-------------+---------+
```
```
(student, class) is the primary key (combination of columns with unique values) for this table.
Each row of this table indicates the name of a student and the class in which they are enrolled.
```

Write a solution to find all the classes that have at least five students.

Return the result table in any order.

The result format is in the following example.



Example 1:

Input:
Courses table:
```
+---------+----------+
| student | class    |
+---------+----------+
| A       | Math     |
| B       | English  |
| C       | Math     |
| D       | Biology  |
| E       | Math     |
| F       | Computer |
| G       | Math     |
| H       | Math     |
| I       | Math     |
+---------+----------+
```
Output:
```
+---------+
| class   |
+---------+
| Math    |
+---------+
```
Explanation:
- Math has 6 students, so we include it.
- English has 1 student, so we do not include it.
- Biology has 1 student, so we do not include it.
- Computer has 1 student, so we do not include it.

In [ ]:
%%sql
Create table If Not Exists Courses (student varchar(255), class varchar(255));
Truncate table Courses;
insert into Courses (student, class) values ('A', 'Math');
insert into Courses (student, class) values ('B', 'English');
insert into Courses (student, class) values ('C', 'Math');
insert into Courses (student, class) values ('D', 'Biology');
insert into Courses (student, class) values ('E', 'Math');
insert into Courses (student, class) values ('F', 'Computer');
insert into Courses (student, class) values ('G', 'Math');
insert into Courses (student, class) values ('H', 'Math');
insert into Courses (student, class) values ('I', 'Math');

In [18]:
%%sql
select class from Courses
group by class
having count(class) > 4

  class
0  Math

# Q3. Monthly Transactions I

Table: Transactions
```
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| id            | int     |
| country       | varchar |
| state         | enum    |
| amount        | int     |
| trans_date    | date    |
+---------------+---------+
```
```
id is the primary key of this table.
The table has information about incoming transactions.
The state column is an enum of type ["approved", "declined"].
 ```

Write an SQL query to find for each month and country, the number of transactions and their total amount, the number of approved transactions and their total amount.

Return the result table in any order.

The query result format is in the following example.



Example 1:

Input:
Transactions table:
```
+------+---------+----------+--------+------------+
| id   | country | state    | amount | trans_date |
+------+---------+----------+--------+------------+
| 121  | US      | approved | 1000   | 2018-12-18 |
| 122  | US      | declined | 2000   | 2018-12-19 |
| 123  | US      | approved | 2000   | 2019-01-01 |
| 124  | DE      | approved | 2000   | 2019-01-07 |
+------+---------+----------+--------+------------+
```
Output:
```
+----------+---------+-------------+----------------+--------------------+-----------------------+
| month    | country | trans_count | approved_count | trans_total_amount | approved_total_amount |
+----------+---------+-------------+----------------+--------------------+-----------------------+
| 2018-12  | US      | 2           | 1              | 3000               | 1000                  |
| 2019-01  | US      | 1           | 1              | 2000               | 2000                  |
| 2019-01  | DE      | 1           | 1              | 2000               | 2000                  |
+----------+---------+-------------+----------------+--------------------+-----------------------+
```

In [19]:
%%sql
-- 1. Создаём пользовательский тип enum
CREATE TYPE transaction_state AS ENUM ('approved', 'declined');

-- 2. Таблица
CREATE TABLE IF NOT EXISTS Transactions (
    id         INT,
    country    VARCHAR(4),
    state      transaction_state,
    amount     INT,
    trans_date DATE
);

-- 3. Очищаем таблицу (если она уже существует)
TRUNCATE TABLE Transactions;

-- 4. Вставляем данные
INSERT INTO Transactions (id, country, state, amount, trans_date) VALUES
('121', 'US', 'approved',  1000, '2018-12-18'),
('122', 'US', 'declined',  2000, '2018-12-19'),
('123', 'US', 'approved',  2000, '2019-01-01'),
('124', 'DE', 'approved',  2000, '2019-01-07');

In [39]:
%%sql
select
    to_char(trans_date, 'yyyy-mm') as month,
    country,
    count(id) as trans_count,
    sum(amount) as trans_total_amount,
    count(*) filter (where state = 'approved') as approved_count,
    coalesce(sum(amount) filter (where state = 'approved'), 0) as approved_total_amount
from Transactions t
group by month, country

,month,country,trans_count,trans_total_amount,approved_count,approved_total_amount
0,2018-12,US,2,3000,1,1000
1,2019-01,US,1,2000,1,2000
2,2019-01,DE,1,2000,1,2000

# Q4. User Activity for the Past 30 Days I

Table: Activity
```
+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| session_id    | int     |
| activity_date | date    |
| activity_type | enum    |
+---------------+---------+
```
```
This table may have duplicate rows.
The activity_type column is an ENUM (category) of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website.
Note that each session belongs to exactly one user.
 ```

Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

Return the result table in any order.

The result format is in the following example.

Note: Any activity from ('open_session', 'end_session', 'scroll_down', 'send_message') will be considered valid activity for a user to be considered active on a day.

Example 1:

Input:
Activity table:
```
+---------+------------+---------------+---------------+
| user_id | session_id | activity_date | activity_type |
+---------+------------+---------------+---------------+
| 1       | 1          | 2019-07-20    | open_session  |
| 1       | 1          | 2019-07-20    | scroll_down   |
| 1       | 1          | 2019-07-20    | end_session   |
| 2       | 4          | 2019-07-20    | open_session  |
| 2       | 4          | 2019-07-21    | send_message  |
| 2       | 4          | 2019-07-21    | end_session   |
| 3       | 2          | 2019-07-21    | open_session  |
| 3       | 2          | 2019-07-21    | send_message  |
| 3       | 2          | 2019-07-21    | end_session   |
| 4       | 3          | 2019-06-25    | open_session  |
| 4       | 3          | 2019-06-25    | end_session   |
+---------+------------+---------------+---------------+
```
Output:
```
+------------+--------------+
| day        | active_users |
+------------+--------------+
| 2019-07-20 | 2            |
| 2019-07-21 | 2            |
+------------+--------------+
```
Explanation: Note that we do not care about days with zero active users.

In [ ]:
%%sql
-- 1. Создаём тип-перечисление вручную
CREATE TYPE activity_type AS ENUM (
    'open_session',
    'end_session',
    'scroll_down',
    'send_message'
);

-- 2. Создаём таблицу
CREATE TABLE IF NOT EXISTS Activity (
    user_id       INT,
    session_id    INT,
    activity_date DATE,
    activity_type activity_type
);

-- 3. Очищаем таблицу
TRUNCATE TABLE Activity;

-- 4. Вставляем данные
INSERT INTO Activity (user_id, session_id, activity_date, activity_type) VALUES
('1', '1', '2019-07-20', 'open_session'),
('1', '1', '2019-07-20', 'scroll_down'),
('1', '1', '2019-07-20', 'end_session'),
('2', '4', '2019-07-20', 'open_session'),
('2', '4', '2019-07-21', 'send_message'),
('2', '4', '2019-07-21', 'end_session'),
('3', '2', '2019-07-21', 'open_session'),
('3', '2', '2019-07-21', 'send_message'),
('3', '2', '2019-07-21', 'end_session'),
('4', '3', '2019-06-25', 'open_session'),
('4', '3', '2019-06-25', 'end_session');

In [42]:
%%sql
select activity_date, count(user_id) from Activity
group by activity_date

  activity_date  count
0    2019-07-21      5
1    2019-07-20      4
2    2019-06-25      2

In [53]:
%%sql
select activity_date as day, count(distinct user_id) as active_users from Activity
where activity_date between '2019-06-28' and '2019-07-27'
group by activity_date
having count(activity_type) > 0

          day  active_users
0  2019-07-20             2
1  2019-07-21             2

Контрольная

In [54]:
%%sql
Create table If Not Exists Products (product_id int, product_name varchar(40), product_category varchar(40));
Create table If Not Exists Orders (product_id int, order_date date, unit int);
Truncate table Products;

insert into Products (product_id, product_name, product_category) values ('1', 'Leetcode Solutions', 'Book');
insert into Products (product_id, product_name, product_category) values ('2', 'Jewels of Stringology', 'Book');
insert into Products (product_id, product_name, product_category) values ('3', 'HP', 'Laptop');
insert into Products (product_id, product_name, product_category) values ('4', 'Lenovo', 'Laptop');
insert into Products (product_id, product_name, product_category) values ('5', 'Leetcode Kit', 'T-shirt');

In [ ]:
%%sql
-- 1. Удаляем старую таблицу Orders
DROP TABLE IF EXISTS Orders;

-- 2. Создаём новую таблицу Orders с правильными типами
CREATE TABLE IF NOT EXISTS Orders (
    product_id  INT,
    order_date  DATE,
    unit        INT
);

-- 3. Вставляем данные
INSERT INTO Orders (product_id, order_date, unit) VALUES
('1', '2020-02-05', 60),
('1', '2020-02-10', 70),
('2', '2020-01-18', 30),
('2', '2020-02-11', 80),
('3', '2020-02-17', 2),
('3', '2020-02-24', 3),
('4', '2020-03-01', 20),
('4', '2020-03-04', 30),
('4', '2020-03-04', 60),
('5', '2020-02-25', 50),
('5', '2020-02-27', 50),
('5', '2020-03-01', 50);

In [70]:
%%sql
select
    product_name,
    sum(unit) as unit
from Orders o join Products p
on o.product_id = p.product_id
where extract(month from order_date) = 2
and extract(year from order_date) = 2020
group by product_name
having sum(unit) > 99

         product_name  unit
0        Leetcode Kit   100
1  Leetcode Solutions   130